{
    "add": [
        "Posição do robo nao reinicia toda vez que arena é recarregada",
        "Corrigido um problema que não permitia o uso da palavra \"valor\" em códigos",
        "Possibilidade de usar Vector2, Vector3 e Quaternion em C#",
        "Suporte a classes e funções C#",
        "Caso não inicie o simulador pelo launcher, ele utiliza a lingua do seu sistema",
        "Padrão de exportação de arquivos é .re para rEduc e .cs para C#",
        "Arenas podem ser salvas em .JSON",
        "Câmera não tem limite de movimentação",
        "Melhorias na interface do editor de arenas",
        "Correções na textura dos ladrilhos C",
        "Arquivo de KeyBinds.JSON novo/alterado",
        "Configuração \"marker_start_margin\" para arenas de quantos ladrilhos a partir da primeira peça não pode inserir marcadores (padrão OBR: 3)",
        "Configuração \"place_markers_after_rescue_zone\" para arenas de poder colocar marcadores após saída da sala de resgate",
        "Gangorras não quebram mais o algoritimo de detecção de linha",
        "Opções de \"spawn do robô\" (quais pontos ele vai aparecer depois de falhas de progresso) da sala de resgate: entrada e saída ou base da rampa",
        "Opção de arena de desativar botão de \"desistir\"",
        "Opção de arena de \"desistir\" dar penalidade de 1 minuto e requerer 20 segundos para executar novas tentativas",
        "Novo KeyBinding.json",
        "Posicionamento de marcadores usa câmera principal",
        "KeyBinds são globais e não só modificam a câmera principal mas também os outros scripts de movimento: Cursor roxo do editor e câmera de pré-visualização de arena",
        "Desalinhamento de peças elevadas/rampas com o resto da arena consertado",
        "Desencaixe entre sala de resgate e resto da arena minimamente alterado",
        "Rampas não geram mais base (assim como as peças elevadas)",
        "Descrições da arena agora aparecem",
        "Altura maxima do editor de arenas foi de 9 para 100",
        "É possível mover o cursor roxo verticalmente no editor de arenas com Z e X",
        "Ladrilhos de erro mostram sua altura",
        "Ladrilho 26 alterado para \"Encruzilhada T Dupla\"",
        "Ladrilho 28 de curvas adicionado T-invertido",
        "É possível desprender (e rotacionar) a câmera do cursor roxo do editor de arenas apertando O",
        "Arenas da OBR geram rampas",
        "Dificuldade afeta rampas/peças elevadas",
        "Dificuldades de arenas geradas alteradas",
        "Gangorras geram nas arenas OBR e RoboCup",
        "w,a,s,d, z e x movem a câmera principal EM SEU EIXO em oposição ao mundo (como era feito antes)",
        "Botao de voltar das configuracoes iniais salva configuracoes",
        "Textura do ladrilho de início",
        "Seguir linha reconhece múltiplos níveis de arenas",
        "Robô salva ultimo atuador usado",
        "Correções gerais de bugs",
        "Nova função Move(força esquerda, força direita), o oposto da antiga onTF",
        "Alias de Wait(int), chamado Delay(int)",
        "Alias de PrintConsole(int, string), chamado Print(int, <string, double, bool>) capaz de imprimir doubles, strings ou booleanos",
        "Alias de WriteBoolean()/WriteNumber()/WriteText(), chamado Write(<string, double, bool>)"
    ],
    "improvement": [
        "Aviso! É necessário adaptar seu código, mais informações abaixo na parte sobre a linguagem",
        "Aviso, se seu código ainda declara essas variáveis por favor delete-as, poderá causar conflitos!",
        "Referência para os Keybinds: <a href=\"https://docs.unity3d.com/ScriptReference/KeyCode.html\">https://docs.unity3d.com/ScriptReference/KeyCode.html</a> (não tem ainda como utilizar scroll)",
        "<b>Aviso!</b> Declaração de variáveis não podem chamar funções <br> -> rEduc: <br> <code style=\"background-color: #343a40;border-radius: 3px;font-weight: 600padding: 0 3px;color: #f1f1f1\"> texto minhaPrimeiraLeitura = cor(1) # PROIBIDO!!!!</code>-> C# (dentro do main se aplica normalmente)  <code style=\"background-color: #343a40;border-radius: 3px;font-weight: 600padding: 0 3px;color: #f1f1f1\">static string teste = bc.DetectColor(0); # PROIBIDO!!!!</code>",
        "<b>Mudanças na edição de temas</b> <code style=\"background-color: #343a40;border-radius: 3px; font-weight: 600; padding: 0 3px;color: #b01a1a\"> - colorSchema.JSON => ColorTheme.json (arquivo renomeado)<br>- \"imagem\" => \"image\" (propriedade renomeada)<br>- \"buttonpressed\" => \"button_pressed\" (propriedade renomeada)<br>- \"buttonhightlight\" => \"button_highlight\" (propriedade renomeada)</code>",
        "<b>Depreciações em massa C#</b>Se você usa C#, vale a pena dar uma olhada nos códigos que você fez. Nossos métodos estão sendo refeitos para seguirmos o padrão do C#. Algumas coisas que não faziam sentido como o console ser chamado de LCD foram trocados nos métodos para Console. Outros o camelCase foi alterado CamelCase, e muitas outras pequenas mudanças. OBS: Você pode continuar usando as funções antigas, porém elas serão REMOVIDAS nas versões posteriores. <a href=\"https://raw.githubusercontent.com/sBotics/builds/main/functions/post.md\">Lista das funções que mudaram</a>",
        "<b>Outras mudanças na Linguagem C#</b> Seus códigos DEVEM conter um void Main() {} que engloba todo o código ou pelo menos suas funções principais, ou se não seu código não compilará. Devido a mudança na forma que o C# está sendo processada estamos experienciando alguns problemas em relação a memória usada e dependendo de sua lógica o simulador pode experienciar crashes."
    ],
    "removed": [
        "Removido atalhos <div><code style=\"background-color: #343a40;border-radius: 3px;font-weight: 600padding: 0 3px;color: #f1f1f1\">CTRL+J</code>, <code style=\"background-color: #343a40;border-radius: 3px;font-weight: 600padding: 0 3px;color: #f1f1f1\">CTRL+L</code>, <code style=\"background-color: #343a40;border-radius: 3px;font-weight: 600padding: 0 3px;color: #f1f1f1\">CTRL+M</code></div>",
        "Peças elevadas não geram mais com base",
        "Numero de marcadores não vai a 0 quando a linha não se encontra",
        "Removida a necessidade de por: int forIteratorLevelN = 0; int[] forIteratorLevel = new int[10];"
    ]
}